app/Filament/Widgets/StatsOverview.php

select count(*) as aggregate from `rooms`
select count(*) as aggregate from `rooms` where `status` = 'available'
select count(*) as aggregate from `tenants`
---
    protected function getStats(): array
    {
        $totalRooms = Room::count();
        $occupiedRooms = Room::where('status', 'occupied')->count();
        $availableRooms = Room::where('status', 'available')->count();

        return [
            // Kamar Terpakai
            Stat::make('Kamar Terpakai', $occupiedRooms)
                ->description("$totalRooms kamar")
                ->url(route('filament.kokakos.resources.rooms.index')),

            // Kamar Tersedia (Tetap Satu)
            Stat::make('Kamar Tersedia', $availableRooms)
                ->description("$totalRooms kamar")
                ->url(route('filament.kokakos.resources.rooms.index')),

            // Total Penghuni
            Stat::make('Total Penghuni', User::count())
                ->url(route('filament.kokakos.resources.tenants.index')),